In [1]:
import pandas as pd

### Create Test Data

In [3]:
df = pd.read_excel("stanford_cars_with_class_names.xlsx")
df.shape

(8144, 8)

In [4]:
df.head()

,Unnamed: 0,x1,y1,x2,y2,class,ture_class_name,image
0,0,39,116,569,375,14,Audi TTS Coupe 2012,00001.jpg
1,1,36,116,868,587,3,Acura TL Sedan 2012,00002.jpg
2,2,85,109,601,381,91,Dodge Dakota Club Cab 2007,00003.jpg
3,3,621,393,1484,1096,134,Hyundai Sonata Hybrid Sedan 2012,00004.jpg
4,4,14,36,133,99,106,Ford F-450 Super Duty Crew Cab 2012,00005.jpg

In [10]:
all_classes = df['class'].unique().tolist()

import random
# 100 classes - randomly
test_classes = random.sample(all_classes, 100)

# remaining 96 is for rice embeddings
rice_classes = [x for x in all_classes if x not in test_classes]

len(test_classes), len(rice_classes)

(100, 96)

In [16]:
test_data = pd.DataFrame(columns = ['image', 'class', 'ture_class_name'])
for cls in test_classes:
    sub_df = df[df['class'] == cls]
    sub_df = sub_df.sample(n=10, random_state=cls)
    test_data = pd.concat([test_data, sub_df[['image', 'class', 'ture_class_name']]])
test_data['true_class_name'] = test_data['ture_class_name'].tolist()
test_data = test_data.drop(['ture_class_name'], axis=1)
print(test_data.shape)
test_data.sample(n=5)

(1000, 3)

          image class                        true_class_name
6385  06386.jpg    55    Chevrolet Corvette Convertible 2012
2388  02389.jpg    85             Dodge Caravan Minivan 1997
2901  02902.jpg   157  MINI Cooper Roadster Convertible 2012
2491  02492.jpg   135             Hyundai Elantra Sedan 2007
2999  03000.jpg    91             Dodge Dakota Club Cab 2007

In [19]:
basepath = "/scratch/workspace/dsaluru_umass_edu-email/stanford_cars/stanford_cars/cars_train/cars_train"
test_data.image.min(), test_data.image.max()

('00003.jpg', '08135.jpg')

In [24]:
test_data['image_path'] = test_data['image'].apply(lambda x: f"{basepath}/{x}")

import os
test_data['image_path'].apply(lambda x: os.path.exists(x)).value_counts()

image_path
True    1000
Name: count, dtype: int64

In [25]:
test_data.head()

,image,class,true_class_name,image_path
2478,02479.jpg,83,Dodge Caliber Wagon 2012,/scratch/workspace/dsaluru_umass_edu-email/sta...
7215,07216.jpg,83,Dodge Caliber Wagon 2012,/scratch/workspace/dsaluru_umass_edu-email/sta...
3898,03899.jpg,83,Dodge Caliber Wagon 2012,/scratch/workspace/dsaluru_umass_edu-email/sta...
3768,03769.jpg,83,Dodge Caliber Wagon 2012,/scratch/workspace/dsaluru_umass_edu-email/sta...
305,00306.jpg,83,Dodge Caliber Wagon 2012,/scratch/workspace/dsaluru_umass_edu-email/sta...

In [26]:
rice_data = pd.DataFrame(columns = ['image', 'class', 'ture_class_name'])
for cls in rice_classes:
    sub_df = df[df['class'] == cls]
    sub_df = sub_df.sample(n=1, random_state=cls)
    rice_data = pd.concat([rice_data, sub_df[['image', 'class', 'ture_class_name']]])
rice_data['true_class_name'] = rice_data['ture_class_name'].tolist()
rice_data = rice_data.drop(['ture_class_name'], axis=1)
print(rice_data.shape)
rice_data.sample(n=5)

(96, 3)

          image class             true_class_name
3190  03191.jpg     5        Acura TSX Sedan 2012
8090  08091.jpg    95      Dodge Durango SUV 2007
2943  02944.jpg   129     Honda Accord Sedan 2012
3205  03206.jpg    23          Audi S4 Sedan 2012
6855  06856.jpg    71  Chevrolet Express Van 2007

In [27]:
rice_data['image_path'] = rice_data['image'].apply(lambda x: f"{basepath}/{x}")

In [28]:
# test_data.to_pickle("stanford_cars_test_data_1k_samples.pickle")

In [29]:
# rice_data.to_pickle("stanford_cars_rice_data_1k_samples.pickle")